# Практика: pandas та matplotlib
---
У цьому ноутбуці зібрані завдання для практики роботи з бібліотеками **pandas** та **matplotlib**.

Спочатку виконай імпорт потрібних бібліотек, а потім рухайся по розділах.

In [5]:
# Імпорт основних бібліотек
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Розділ 1. Основи pandas: створення та перегляд даних
**Мета:** навчитися створювати `DataFrame`, переглядати структуру та базову інформацію.

**Завдання 1–10:**
1. Імпортуй бібліотеки `pandas` і `numpy` (вже зроблено вище, але спробуй сам у новій комірці).
2. Створи простий DataFrame з трьох стовпців: `"Name"`, `"Age"`, `"City"` (5–7 рядків).
3. Виведи перші 5 рядків DataFrame.
4. Виведи інформацію про типи даних (`.info()`) і статистику (`.describe()`).
5. Виведи назви всіх стовпців і індексів.
6. Зміни порядок стовпців у DataFrame.
7. Встанови стовпець `"Name"` як індекс.
8. Перейменуй стовпець `"City"` на `"Hometown"`.
9. Зроби копію DataFrame і додай новий стовпець `"Country"` зі значенням `"Ukraine"`.
10. Виведи тільки стовпці `"Name"` та `"Age"`.

In [6]:
# Розв'язання для завдань 1–10
# Напиши свій код нижче. Можеш додавати нові комірки, якщо потрібно.

# Твій код тут ↓

# 2 
df = pd.DataFrame({
    'Name':['Anna', 'Maria', 'Taras', 'Mark', 'Max'],
    'Age':[15, 20, 65, 12, 43],
    'City':['Kyiv', 'London', 'New York', 'Paris', 'Madrid']
})

In [7]:
df

    Name  Age      City
0   Anna   15      Kyiv
1  Maria   20    London
2  Taras   65  New York
3   Mark   12     Paris
4    Max   43    Madrid

In [8]:
# 3a Виведи інформацію про типи даних (.info()) і статистику (.describe())

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [9]:
# 3b 

df.describe()

             Age
count   5.000000
mean   31.000000
std    22.572107
min    12.000000
25%    15.000000
50%    20.000000
75%    43.000000
max    65.000000

In [10]:
# 5a Виведи назви всіх стовпців 

df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [11]:
# 5b Виведи назви всіх індексів

df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
# 6 Зміни порядок стовпців у DataFrame

df = pd.DataFrame({
    'Name':['Anna', 'Maria', 'Taras', 'Mark', 'Max'],
    'Age':[15, 20, 65, 12, 43],
    'City':['Kyiv', 'London', 'New York', 'Paris', 'Madrid']
})

df = df[['City', 'Name', 'Age']]

df

       City   Name  Age
0      Kyiv   Anna   15
1    London  Maria   20
2  New York  Taras   65
3     Paris   Mark   12
4    Madrid    Max   43

In [13]:
#7 Встанови стовпець "Name" як індекс

print(df.loc[1])

City    London
Name     Maria
Age         20
Name: 1, dtype: object

In [14]:
#8 Перейменуй стовпець "City" на "Hometown"

df = df.rename(columns={'City':'Hometown'})

df

   Hometown   Name  Age
0      Kyiv   Anna   15
1    London  Maria   20
2  New York  Taras   65
3     Paris   Mark   12
4    Madrid    Max   43

In [15]:
#9 Додай новий стовпець "Country" зі значенням "Ukraine"

df['Country'] = 'Ukraine'

df

   Hometown   Name  Age  Country
0      Kyiv   Anna   15  Ukraine
1    London  Maria   20  Ukraine
2  New York  Taras   65  Ukraine
3     Paris   Mark   12  Ukraine
4    Madrid    Max   43  Ukraine

In [16]:
#10 Виведи тільки стовпці "Name" та "Age"

df[['Name', 'Age']]

    Name  Age
0   Anna   15
1  Maria   20
2  Taras   65
3   Mark   12
4    Max   43

## Розділ 2. Фільтрація та сортування
**Мета:** навчитися відбирати рядки за умовами, сортувати дані, працювати з індексами.

**Завдання 11–20:** (використовуй DataFrame з попереднього розділу або створи новий)
11. Вибери всі рядки, де `"Age" > 25`.   
12. Вибери всі рядки, де `"City"` (або `"Hometown"`) дорівнює `"Kyiv"`.  
13. Вибери рядки, де `"Age"` між 20 і 30 включно.  
14. Відсортуй таблицю за віком у порядку спадання.  
15. Відсортуй за двома стовпцями — спочатку `"City"`, потім `"Age"`.  
16. Перевір, чи є дублікати в `"Name"` і видали їх.  
17. Відфільтруй усіх користувачів, які **не** з Києва.  
18. Вибери випадкові 3 рядки з DataFrame (`.sample(3)`).  
19. Переміскай усі рядки DataFrame (за допомогою `.sample(frac=1)`).  
20. Додай новий рядок до DataFrame з вигаданими даними.

In [17]:
# Розв'язання для завдань 11–20
# Використовуй DataFrame з попереднього розділу (наприклад, df).

# Твій код тут ↓

#11 Вибери всі рядки, де "Age" > 25

df = pd.DataFrame({
    'Name':['Anna', 'Maria', 'Taras', 'Mark', 'Max'],
    'Age':[15, 20, 65, 12, 43],
    'City':['Kyiv', 'London', 'New York', 'Paris', 'Madrid']
})

df.loc[2]

Name       Taras
Age           65
City    New York
Name: 2, dtype: object

In [18]:
# 12 Вибери всі рядки, де "City" (або "Hometown") дорівнює "Kyiv"

df = pd.DataFrame({
    'Name':['Anna', 'Maria', 'Taras', 'Mark', 'Max'],
    'Age':[15, 20, 65, 12, 43],
    'City':['Kyiv', 'London', 'New York', 'Paris', 'Madrid']
})

df.loc[(df.City == 'Kyiv')]

   Name  Age  City
0  Anna   15  Kyiv

In [19]:
# 13 Вибери рядки, де "Age" між 20 і 30 включно

df[(df["Age"] >= 20) & (df["Age"] <= 30)]

    Name  Age    City
1  Maria   20  London

In [20]:
# 14 Відсортуй таблицю за віком у порядку спадання 

df.sort_values(by="Age", ascending=False)

    Name  Age      City
2  Taras   65  New York
4    Max   43    Madrid
1  Maria   20    London
0   Anna   15      Kyiv
3   Mark   12     Paris

In [21]:
# 15 Відсортуй за двома стовпцями — спочатку "City", потім "Age"

df.sort_values(["City", "Age"])

    Name  Age      City
0   Anna   15      Kyiv
1  Maria   20    London
4    Max   43    Madrid
2  Taras   65  New York
3   Mark   12     Paris

In [22]:
# 16 Перевір, чи є дублікати в "Name" і видали їх

df.drop_duplicates(subset='Name')

    Name  Age      City
0   Anna   15      Kyiv
1  Maria   20    London
2  Taras   65  New York
3   Mark   12     Paris
4    Max   43    Madrid

In [23]:
# 17 Відфільтруй усіх користувачів, які **не** з Києва

df.loc[df["City"] != "Kyiv"]

    Name  Age      City
1  Maria   20    London
2  Taras   65  New York
3   Mark   12     Paris
4    Max   43    Madrid

In [24]:
# 18 Вибери випадкові 3 рядки з DataFrame (.sample(3))

df.sample(3)

    Name  Age    City
1  Maria   20  London
0   Anna   15    Kyiv
4    Max   43  Madrid

In [25]:
# 19 Перемішай усі рядки DataFrame (за допомогою .sample(frac=1))

df.sample(frac=1)

    Name  Age      City
1  Maria   20    London
2  Taras   65  New York
4    Max   43    Madrid
0   Anna   15      Kyiv
3   Mark   12     Paris

In [26]:
# 20 Додай новий рядок до DataFrame з вигаданими даними

df.loc[len(df)] = {'Name': 'Renat', 'Age': 26, 'City': 'Megion'}

df.tail()

    Name  Age      City
1  Maria   20    London
2  Taras   65  New York
3   Mark   12     Paris
4    Max   43    Madrid
5  Renat   26    Megion

## Розділ 3. Робота з відсутніми значеннями (NaN)
**Мета:** навчитися виявляти, замінювати та видаляти пропущені значення.

**Завдання 21–26:**
21. Створи DataFrame з кількома пропущеними значеннями (`NaN`) у числових і текстових стовпцях.  
22. Замінити всі `NaN` у текстових стовпцях на `"Unknown"`.  
23. Замінити `NaN` у числових стовпцях на середнє значення відповідного стовпця.  
24. Видалити всі рядки, де хоча б одне значення пропущене.  
25. Перевір кількість пропущених значень у кожному стовпці (`.isna().sum()`).  
26. Створи DataFrame з числовими і текстовими стовпцями та перевір `.dtypes`.

In [27]:
# Розв'язання для завдань 21–26
# Підказка: використовуй np.nan для створення пропусків.

# Твій код тут ↓

In [28]:
# 21 Створи DataFrame з кількома пропущеними значеннями (NaN) у числових і текстових стовпцях.

df = pd.DataFrame({
    'Name':['Anna', 'NaN', 'Taras', 'Mark', 'Max'],
    'Level':['NaN', 'B2', 'A2', 'NaN', 'B1'],
    'Age':[34, 27, 30, 'NaN', 'NaN']
})

df

    Name Level  Age
0   Anna   NaN   34
1    NaN    B2   27
2  Taras    A2   30
3   Mark   NaN  NaN
4    Max    B1  NaN

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Level   5 non-null      object
 2   Age     5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

In [30]:
df.describe()

        Name Level  Age
count      5     5    5
unique     5     4    4
top     Anna   NaN  NaN
freq       1     2    2

In [31]:
# 22 Замінити всі NaN у текстових стовпцях на "Unknown"

text_cols = df.select_dtypes(include='object').columns

df[text_cols] = df[text_cols].fillna("Unknown")

print(df)

    Name Level  Age
0   Anna   NaN   34
1    NaN    B2   27
2  Taras    A2   30
3   Mark   NaN  NaN
4    Max    B1  NaN

In [32]:
# 23 Замінити NaN у числових стовпцях на середнє значення відповідного стовпця

num_cols = df.select_dtypes(include='number').columns

for col in num_cols:
    mean_value = df[col].mean()
    df[col].fillna(mean_value, inplace=True)

print(df)

    Name Level  Age
0   Anna   NaN   34
1    NaN    B2   27
2  Taras    A2   30
3   Mark   NaN  NaN
4    Max    B1  NaN

In [33]:
# 24 Видалити всі рядки, де хоча б одне значення пропущене

df = pd.DataFrame({
    'Name':['Anna', 'NaN', 'Taras', 'Mark', 'Max'],
    'Level':['NaN', 'B2', 'A2', 'NaN', 'B1'],
    'Age':[34, 27, 30, 'NaN', 'NaN']
})

df = df.replace('NaN', np.nan)

df_clean = df.dropna()

print(df_clean)

    Name Level   Age
2  Taras    A2  30.0

/var/folders/p4/8m8dkths1rs0n168k0m6ftlr0000gn/T/ipykernel_93918/1502173136.py:9: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df = df.replace('NaN', np.nan)

In [34]:
# 25 Перевір кількість пропущених значень у кожному стовпці (.isna().sum())

df = pd.DataFrame({
    'Name':['Anna', 'NaN', 'Taras', 'Mark', 'Max'],
    'Level':['NaN', 'B2', 'A2', 'NaN', 'B1'],
    'Age':[34, 27, 30, 'NaN', 'NaN']
})

df = df.replace('NaN', np.nan)

print(df.isna().sum())

Name     1
Level    2
Age      2
dtype: int64

/var/folders/p4/8m8dkths1rs0n168k0m6ftlr0000gn/T/ipykernel_93918/1629492458.py:9: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df = df.replace('NaN', np.nan)

In [35]:
# 26 Створи DataFrame з числовими і текстовими стовпцями та перевір .dtypes

df.dtypes

Name      object
Level     object
Age      float64
dtype: object

## Розділ 4. Групування, агрегація, статистика
**Мета:** навчитися використовувати `groupby`, агрегації, зведені таблиці.

**Завдання 27–35:**
27. Створи DataFrame про продажі з колонками: `"Product"`, `"Category"`, `"Price"`, `"Quantity"` (10–15 рядків).  
28. Знайди загальний дохід (`Price * Quantity`) і додай його як новий стовпець `"Revenue"`.  
29. Порахуйте загальний дохід для кожної категорії (`groupby("Category")["Revenue"].sum()`).  
30. Знайди середню ціну по кожному `"Product"`.  
31. Визнач найпопулярніший товар (за сумарною кількістю продажів).  
32. Знайди мінімальний і максимальний дохід по категорії.  
33. Зроби зведену таблицю (`pivot_table`) з категоріями по рядках і середнім доходом по стовпцях.  
34. Відсортуй категорії за середнім доходом.  
35. Додай стовпець `"Profit" = "Revenue" * 0.25` і знайди середній прибуток по категоріях.

In [36]:
# Розв'язання для завдань 27–35
# Підказка: можеш згенерувати випадкові дані за допомогою np.random.

# Твій код тут ↓

In [37]:
# 27 Створи DataFrame про продажі з колонками: "Product", "Category", "Price", "Quantity" (10–15 рядків)

df_sale = pd.DataFrame({
    'Product':['Bread', 'Milk', 'Fish', 'Water', 'Meat', 'Bread', 'Yoghurt', 'Shrimp', 'Banana', 'Cabbage']
    , 'Category':['Bakery', 'Dairy', 'Seafood', 'Drinks', 'Meat Products', 'Bakery', 'Diary', 'Seafood', 'Fruts', 'Vegetables']
    , 'Price':[0.89, 1.15, 5.3, 0.79, 4.99, 0.49, 1.20, 3.50, 1.99, 0.99 ]
    , 'Quantity': [1, 2, 1, 3, 1, 1, 2, 1, 2, 1]
})

df_sale

   Product       Category  Price  Quantity
0    Bread         Bakery   0.89         1
1     Milk          Dairy   1.15         2
2     Fish        Seafood   5.30         1
3    Water         Drinks   0.79         3
4     Meat  Meat Products   4.99         1
5    Bread         Bakery   0.49         1
6  Yoghurt          Diary   1.20         2
7   Shrimp        Seafood   3.50         1
8   Banana          Fruts   1.99         2
9  Cabbage     Vegetables   0.99         1

In [38]:
df_sale.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Product   10 non-null     object
 1   Category  10 non-null     object
 2   Price     10 non-null     float64
 3   Quantity  10 non-null     int64
dtypes: float64(1), int64(1), object(2)
memory usage: 452.0+ bytes

In [39]:
df_sale.describe()

           Price   Quantity
count  10.000000  10.000000
mean    2.129000   1.500000
std     1.803475   0.707107
min     0.490000   1.000000
25%     0.915000   1.000000
50%     1.175000   1.000000
75%     3.122500   2.000000
max     5.300000   3.000000

In [40]:
df_sale.shape

(10, 4)

In [41]:
df_sale.dtypes

Product      object
Category     object
Price       float64
Quantity      int64
dtype: object

In [42]:
df_sale.isna().sum()

Product     0
Category    0
Price       0
Quantity    0
dtype: int64

In [43]:
df_sale.sample()

  Product Category  Price  Quantity
3   Water   Drinks   0.79         3

In [44]:
# 28 Знайди загальний дохід (Price * Quantity) і додай його як новий стовпець "Revenue"

df_sale['Revenue'] = df_sale['Price'] * df_sale['Quantity']

df_sale

   Product       Category  Price  Quantity  Revenue
0    Bread         Bakery   0.89         1     0.89
1     Milk          Dairy   1.15         2     2.30
2     Fish        Seafood   5.30         1     5.30
3    Water         Drinks   0.79         3     2.37
4     Meat  Meat Products   4.99         1     4.99
5    Bread         Bakery   0.49         1     0.49
6  Yoghurt          Diary   1.20         2     2.40
7   Shrimp        Seafood   3.50         1     3.50
8   Banana          Fruts   1.99         2     3.98
9  Cabbage     Vegetables   0.99         1     0.99

In [45]:
# 29 Порахуйте загальний дохід для кожної категорії (groupby("Category")["Revenue"].sum())

df_sale.groupby("Category")["Revenue"].sum()

Category
Bakery           1.38
Dairy            2.30
Diary            2.40
Drinks           2.37
Fruts            3.98
Meat Products    4.99
Seafood          8.80
Vegetables       0.99
Name: Revenue, dtype: float64

In [46]:
# 30 Знайди середню ціну по кожному "Product"

df_sale.groupby("Product")["Price"].mean()

Product
Banana     1.99
Bread      0.69
Cabbage    0.99
Fish       5.30
Meat       4.99
Milk       1.15
Shrimp     3.50
Water      0.79
Yoghurt    1.20
Name: Price, dtype: float64

In [47]:
# 31 Визнач найпопулярніший товар (за сумарною кількістю продажів)

df_sale.groupby("Product")["Quantity"].sum()

Product
Banana     2
Bread      2
Cabbage    1
Fish       1
Meat       1
Milk       2
Shrimp     1
Water      3
Yoghurt    2
Name: Quantity, dtype: int64

In [48]:
# 32 Знайди мінімальний і максимальний дохід по категорії

df_sale["Revenue"].agg([np.max, np.min])

/var/folders/p4/8m8dkths1rs0n168k0m6ftlr0000gn/T/ipykernel_93918/3426969509.py:3: FutureWarning: The provided callable <function max at 0x10f9c5f80> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df_sale["Revenue"].agg([np.max, np.min])
/var/folders/p4/8m8dkths1rs0n168k0m6ftlr0000gn/T/ipykernel_93918/3426969509.py:3: FutureWarning: The provided callable <function min at 0x10f9c60c0> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  df_sale["Revenue"].agg([np.max, np.min])

max    5.30
min    0.49
Name: Revenue, dtype: float64

In [49]:
# 33 Зроби зведену таблицю (pivot_table) з категоріями по рядках і середнім доходом по стовпцях. 

pivot = df_sale.pivot_table(
    index="Category"
    , values="Revenue"
    , aggfunc="mean"
)

print(pivot)

               Revenue
Category
Bakery            0.69
Dairy             2.30
Diary             2.40
Drinks            2.37
Fruts             3.98
Meat Products     4.99
Seafood           4.40
Vegetables        0.99

In [50]:
# 34 Відсортуй категорії за середнім доходом

df_sale.groupby("Category")["Revenue"].mean().sort_values(ascending=False)

Category
Meat Products    4.99
Seafood          4.40
Fruts            3.98
Diary            2.40
Drinks           2.37
Dairy            2.30
Vegetables       0.99
Bakery           0.69
Name: Revenue, dtype: float64

In [51]:
# 35 Додай стовпець "Profit" = "Revenue" * 0.25 і знайди середній прибуток по категоріях

df_sale['Profit'] = df_sale['Revenue'] * 0.25

df_sale.groupby('Category')['Profit'].mean()

Category
Bakery           0.1725
Dairy            0.5750
Diary            0.6000
Drinks           0.5925
Fruts            0.9950
Meat Products    1.2475
Seafood          1.1000
Vegetables       0.2475
Name: Profit, dtype: float64

## Розділ 5. Злиття, об’єднання та збереження даних
**Мета:** навчитися з'єднувати таблиці, знаходити відсутні зв'язки, зберігати дані в CSV.

**Завдання 36–40:**
36. Створи два DataFrame: `customers` і `orders`:
   - `customers`: `CustomerID`, `Name`, `City`  
   - `orders`: `OrderID`, `CustomerID`, `Amount`  
   З’єднай їх за `CustomerID` (`pd.merge`).  
37. Об’єднай дві таблиці вертикально (`pd.concat`).  
38. Знайди клієнтів, які **не мають** замовлень (left join + `NaN` у `"Amount"`).  
39. Збережи результат у CSV-файл (`.to_csv("customers_orders.csv", index=False)`) і потім зчитай його назад (`pd.read_csv`).  
40. Перевір, чи зчитані типи даних збігаються з оригіналом (порівняй `.dtypes`).

In [52]:
# Розв'язання для завдань 36–40
# Твій код тут ↓

In [ ]:
# 36a Створи два DataFrame: customers і orders:
#    - customers: CustomerID, Name, City  
#    - orders: OrderID, CustomerID, Amount  
# 36b З’єднай їх за CustomerID (pd.merge)

df_customers = pd.DataFrame({
    'CustomerID':[11, 26, 29, 4, 12, 27, 13]
    , 'Name':['Yuliia', 'Dmytro', 'Petro', 'Valentyna', 'Mykola', 'Lidiya','Svitlana']
    , 'City':['Poltava', 'Lviv', 'Chernovtsy', 'Kherson', 'Stanislav', 'Megion', 'Stanislav']
})

df_customers

   CustomerID       Name        City
0          11     Yuliia     Poltava
1          26     Dmytro        Lviv
2          29      Petro  Chernovtsy
3           4  Valentyna     Kherson
4          12     Mykola   Stanislav
5          27     Lidiya      Megion
6          13   Svitlana   Stanislav

In [94]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  7 non-null      int64
 1   Name        7 non-null      object
 2   City        7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [ ]:
df_customers.describe()

       CustomerID
count    7.000000
mean    17.428571
std      9.744351
min      4.000000
25%     11.500000
50%     13.000000
75%     26.500000
max     29.000000

In [97]:
df_customers.shape

(7, 3)

In [98]:
df_customers.sample()

   CustomerID    Name    City
5          27  Lidiya  Megion

In [93]:
df_orders = pd.DataFrame({
    'OrderID':[5, 9, 46, 54, 76, 84, 74]
    , 'CustomerID':[11, 26, 29, 4, 12, 27, 13]
    , 'Amount':[20, 16, 56, 71, 49, 41, 51]
})

df_orders

   OrderID  CustomerID  Amount
0        5          11      20
1        9          26      16
2       46          29      56
3       54           4      71
4       76          12      49
5       84          27      41
6       74          13      51

In [99]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   OrderID     7 non-null      int64
 1   CustomerID  7 non-null      int64
 2   Amount      7 non-null      int64
dtypes: int64(3)
memory usage: 300.0 bytes

In [100]:
df_orders.describe()

         OrderID  CustomerID     Amount
count   7.000000    7.000000   7.000000
mean   49.714286   17.428571  43.428571
std    32.003720    9.744351  19.637185
min     5.000000    4.000000  16.000000
25%    27.500000   11.500000  30.500000
50%    54.000000   13.000000  49.000000
75%    75.000000   26.500000  53.500000
max    84.000000   29.000000  71.000000

In [102]:
# 36b З’єднай їх за CustomerID (pd.merge)

pd.merge(df_customers, df_orders, on='CustomerID')

   CustomerID       Name        City  OrderID  Amount
0          11     Yuliia     Poltava        5      20
1          26     Dmytro        Lviv        9      16
2          29      Petro  Chernovtsy       46      56
3           4  Valentyna     Kherson       54      71
4          12     Mykola   Stanislav       76      49
5          27     Lidiya      Megion       84      41
6          13   Svitlana   Stanislav       74      51

In [103]:
# 37 Об’єднай дві таблиці вертикально (pd.concat)

df_customers_orders = pd.concat([df_customers, df_orders], ignore_index=True)

print(df_customers_orders)

    CustomerID       Name        City  OrderID  Amount
0           11     Yuliia     Poltava      NaN     NaN
1           26     Dmytro        Lviv      NaN     NaN
2           29      Petro  Chernovtsy      NaN     NaN
3            4  Valentyna     Kherson      NaN     NaN
4           12     Mykola   Stanislav      NaN     NaN
5           27     Lidiya      Megion      NaN     NaN
6           13   Svitlana   Stanislav      NaN     NaN
7           11        NaN         NaN      5.0    20.0
8           26        NaN         NaN      9.0    16.0
9           29        NaN         NaN     46.0    56.0
10           4        NaN         NaN     54.0    71.0
11          12        NaN         NaN     76.0    49.0
12          27        NaN         NaN     84.0    41.0
13          13        NaN         NaN     74.0    51.0

In [105]:
# 38 Знайди клієнтів, які **не мають** замовлень (left join + NaN у "Amount")

df_customers_orders_1 = df_customers.merge(df_orders, on='CustomerID', how='left')

print(df_customers_orders_1)

   CustomerID       Name        City  OrderID  Amount
0          11     Yuliia     Poltava        5      20
1          26     Dmytro        Lviv        9      16
2          29      Petro  Chernovtsy       46      56
3           4  Valentyna     Kherson       54      71
4          12     Mykola   Stanislav       76      49
5          27     Lidiya      Megion       84      41
6          13   Svitlana   Stanislav       74      51

In [107]:
# 39 Збережи результат у CSV-файл (.to_csv("customers_orders.csv", index=False)) і потім зчитай його назад (pd.read_csv)

df_customers_orders_1.to_csv("customers_orders.csv", index=False)

df_loaded = pd.read_csv("customers_orders.csv")

In [108]:
# 40 Перевір, чи зчитані типи даних збігаються з оригіналом (порівняй .dtypes)

print(df_customers_orders_1.dtypes) 
print(df_loaded.dtypes)

CustomerID     int64
Name          object
City          object
OrderID        int64
Amount         int64
dtype: object
CustomerID     int64
Name          object
City          object
OrderID        int64
Amount         int64
dtype: object

## Розділ 6. Робота з датами і часом
**Мета:** навчитися працювати з датами, витягати компоненти дати, фільтрувати за часом.

**Завдання 41–45:**
41. Створи DataFrame з колонкою `"date"` від `"2024-01-01"` до `"2024-01-10"` (використай `pd.date_range`).  
42. Додай новий стовпець `"day_of_week"`, що показує день тижня.  
43. Вибери всі дні вихідного (`Saturday`, `Sunday`).  
44. Знайди різницю між найпізнішою та найранішою датою (`date.max() - date.min()`).  
45. Додай колонку `"month"` і порахуй, скільки записів у кожному місяці.

In [58]:
# Розв'язання для завдань 41–45
# Твій код тут ↓

In [109]:
# 41 Створи DataFrame з колонкою "date" від "2024-01-01" до "2024-01-10" (використай pd.date_range)

dates = pd.date_range(start="2024-01-01", end="2024-01-10")
df_decade_1_jan = pd.DataFrame({"date": dates})

print(df_decade_1_jan)

        date
0 2024-01-01
1 2024-01-02
2 2024-01-03
3 2024-01-04
4 2024-01-05
5 2024-01-06
6 2024-01-07
7 2024-01-08
8 2024-01-09
9 2024-01-10

In [130]:
# 42 Додай новий стовпець "day_of_week", що показує день тижня

df_decade_1_jan["date"] = pd.to_datetime(df_decade_1_jan["date"])
df_decade_1_jan["day_of_week"] = df_decade_1_jan["date"].dt.day_name()

print(df_decade_1_jan)

        date day_of_week
0 2024-01-01      Monday
1 2024-01-02     Tuesday
2 2024-01-03   Wednesday
3 2024-01-04    Thursday
4 2024-01-05      Friday
5 2024-01-06    Saturday
6 2024-01-07      Sunday
7 2024-01-08      Monday
8 2024-01-09     Tuesday
9 2024-01-10   Wednesday

In [133]:
# 43 Вибери всі дні вихідного (Saturday, Sunday)

weekends = df_decade_1_jan[df_decade_1_jan["day_of_week"].isin(["Satureday", "Sunday"])]

print(weekends)

        date day_of_week
6 2024-01-07      Sunday

In [ ]:
# 44 Знайди різницю між найпізнішою та найранішою датою (date.max() - date.min())

In [ ]:
# 45 Додай колонку "month" і порахуй, скільки записів у кожному місяці.

## Розділ 7. Основи matplotlib
**Мета:** навчитися будувати базові графіки з використанням `matplotlib`.

**Завдання 46–50:**
46. Імпортуй бібліотеку `matplotlib.pyplot` під псевдонімом `plt` (вже зроблено вище, але спробуй окремо).  
47. Побудуй простий лінійний графік:  
   ```python  
   x = [1, 2, 3, 4, 5]  
   y = [10, 8, 6, 4, 2]  
   plt.plot(x, y)  
   plt.show()  
   ```
48. Додай підписи осей (`xlabel`, `ylabel`) і заголовок (`title`).  
49. Змініть зовнішній вигляд лінії: стиль (`'--'`, `'-.'`), маркери (`'o'`, `'s'`), товщину (`linewidth`).  
50. Побудуй **два графіки на одному полі** (додай другий виклик `plt.plot()` перед `plt.show()`).

In [64]:
# Розв'язання для завдань 46–50
# Твій код тут ↓

In [65]:
# 46

In [66]:
# 47

In [67]:
# 48

In [68]:
# 49

In [69]:
# 50

## Розділ 8. Графіки з pandas + matplotlib
**Мета:** навчитися будувати графіки безпосередньо з DataFrame.

**Завдання 51–60:**
51. Створи DataFrame з продажами по місяцях: стовпці `"Month"`, `"Revenue"`.  
52. Побудуй лінійний графік `Revenue` по місяцях (`df.plot(x="Month", y="Revenue")`).  
53. Побудуй стовпчикову діаграму продажів по категоріях (`bar`).  
54. Побудуй горизонтальну стовпчикову діаграму (`barh`).  
55. Побудуй кругову діаграму (`pie`) для відсотку продажів по категоріях.  
56. Створи DataFrame з віком клієнтів і побудуй гістограму розподілу віку (`hist`).  
57. Побудуй `boxplot` для цін (`Price`).  
58. Побудуй `scatter plot` між `"Price"` і `"Quantity"`.  
59. Зміни стиль графіка (наприклад, `plt.style.use("ggplot")`).  
60. Додай підписи значень на стовпчиковому графіку (через `plt.text` або `ax.bar_label()`).

In [70]:
# Розв'язання для завдань 51–60
# Твій код тут ↓

In [71]:
# 51

In [72]:
# 52

In [73]:
# 53

In [74]:
# 54

In [75]:
# 55

In [76]:
# 56

In [77]:
# 57

In [78]:
# 58

In [79]:
# 59

In [80]:
# 60

## Розділ 9. Комбіновані завдання (pandas + matplotlib)
**Мета:** поєднати обробку даних та візуалізацію.

**Завдання 61–70:**
61. Створи або зчитай з CSV DataFrame з даними про продажі: дата, товар, категорія, ціна, кількість, місто.  
62. Порахуйте загальний дохід по місяцях і побудуйте лінійний графік.  
63. Визнач топ-3 товари за продажами (за `Revenue`) і побудуй для них стовпчиковий графік.  
64. Побудуй порівняння доходів по містах (стовпчиковий графік).  
65. Обчисли кореляцію між числовими стовпцями (`df.corr()`) і побудуй `heatmap` (через `plt.imshow` або іншу бібліотеку).  
66. Побудуй `subplot` із двома графіками: лінійний (Revenue по місяцях) і стовпчиковий (Revenue по категоріях).  
67. Створи кілька серій даних (наприклад, Revenue за 2 роки) і побудуй їх разом на одному графіку з легендою.  
68. Побудуй графік із вторинною віссю (`twinx`): стовпчики для Revenue і лінія для середньої ціни.  
69. Збережи один із графіків у PNG-файл (`plt.savefig("sales_chart.png", dpi=300)`).  
70. Зроби зведену таблицю продажів по місяцях і побудуй її графік одразу з pandas (`pivot_table` + `.plot()`).

In [81]:
# Розв'язання для завдань 61–70
# Твій код тут ↓

In [82]:
# 61

In [83]:
# 62

In [84]:
# 63

In [85]:
# 64

In [86]:
# 65

In [87]:
# 66

In [88]:
# 67

In [89]:
# 68

In [90]:
# 69

In [91]:
# 70